define({
  "addTaskTip": "Προσθέστε ένα ή περισσότερα φίλτρα στο widget και διαμορφώστε τις παραμέτρους για καθένα από αυτά.",
  "enableMapFilter": "Καταργήστε το προκαθορισμένο φίλτρο θεματικού επιπέδου από το χάρτη.",
  "newFilter": "Νέο φίλτρο",
  "filterExpression": "Έκφραση φίλτρου",
  "layerDefaultSymbolTip": "Χρήση του προκαθορισμένου συμβόλου του θεματικού επιπέδου",
  "uploadImage": "Μεταφορτώστε μια εικόνα",
  "selectLayerTip": "Επιλέξτε ένα θεματικό πεδίο.",
  "setTitleTip": "Επιλέξτε τίτλο."
});