define({
  "_widgetLabel": "फिल्टर करें",
  "toggleTip": "फिल्टर सेटिंग्स को दिखाने/छिपाने के लिए क्लिक करें",
  "toggleOn": "वर्तमान फ़िल्टर चालू करने के लिए टॉगल बटन दबाएँ",
  "toggleOff": "वर्तमान फ़िल्टर बंद करने के लिए टॉगल बटन दबाएँ",
  "filterActions": "कार्रवाइयां फ़िल्टर करें",
  "resetAll": "सभी इनपुट वैल्यूज़ को रीसेट करें",
  "turnOffAll": "सभी फिल्टर्स को बंद करें",
  "createCustomFilter": "कस्टम फ़िल्टर बनाएँ",
  "customFilter": "कस्टम फ़िल्टर",
  "toggleCustomFilter": "फ़िल्टर को चालू या बंद करने के लिए टॉगल करें",
  "toggleCustomFilters": "सभी फ़िल्टर चालू या बंद करें"
});