define({
  "layersPage": {
    "title": "फीचर बनाने के लिए एक टेम्पलेट का चयन करें",
    "generalSettings": "सामान्य सेटिंग",
    "layerSettings": "लेयर सेटिंग",
    "editDescription": "संशोधन पैनल के लिए डिस्प्ले पाठ प्रदान करता है",
    "editDescriptionTip": "यह पाठ टेम्पलेट पिकर के ऊपर प्रदर्शित किया जाता है, खाली पाठ के लिए खाली छोड़ दें।",
    "promptOnSave": "जब प्रपत्र बंद या अगले रिकॉर्ड पर स्विच करता है,तो नहीं सहेजे गए संशोधन को सहेजने के लिए पूछता है।",
    "promptOnSaveTip": "जब उपयोगकर्ता बंद क्लिक करता है या अगले संपादन योग्य रिकॉर्ड पर जाता है जब मौजूदा फीचर में नहीं सहेजे गए संपादन होते है, तो एक प्रांप्ट प्रदर्शित करें।",
    "promptOnDelete": "जब एक रिकॉर्ड को मिटाया जाता है तो पुष्टि की आवश्यकता होती है।",
    "promptOnDeleteTip": "जब उपयोगकर्ता क्रिया की पुष्टि करने के लिए मिटाना को क्लिक करता है, तब प्रांप्ट प्रदर्शित करें।",
    "removeOnSave": "सहेजने पर चयन से फीचर को हटाएं।",
    "removeOnSaveTip": "जब रिकॉर्ड सहेजा जाता है तो चयन सेट से फीचर हटाने का विकल्प। यदि यह केवल चयनित रिकॉर्ड है, पैनल टेम्पलेट पृष्ठ पर वापस भेज दिया जाता है।",
    "useFilterEditor": "फीचर टेम्पलेट फिल्टर का प्रयोग करें",
    "useFilterEditorTip": "फ़िल्टर टेम्पलेट पिकर का उपयोग करने के लिए विकल्प जो एक लेयर टेम्पलेट्स देखने या नाम द्वारा टेम्पलेट्स की खोज करने की क्षमता प्रदान करता है।",
    "listenToGroupFilter": "समूह फिल्टर विजेट से मौजूदा फ़ील्ड पर फिल्टर मान लागू करें",
    "listenToGroupFilterTip": "जब एक फिल्टर को समूह फिल्टर विजेट में लागू किया जाता है, तो मौजूदा मान सूची में एक मिलती जुलती फ़ील्ड के लिए मान लागू करें।",
    "keepTemplateActive": "चयनित टेम्पलेट सक्रिय रखें",
    "keepTemplateActiveTip": "जब टेम्पलेट पिकर दिखाया जाता है, अगर टेम्पलेट को पहले से चयनित किया गया था, तो इसे फिर से चुनें।",
    "geometryEditDefault": "डिफ़ॉल्ट रूप से ज्यामिति संपादन सक्षम करें",
    "autoSaveEdits": "स्वचालित रूप से संपादन सहेजता है",
    "layerSettingsTable": {
      "allowDelete": "मिटाने की अनुमति दें",
      "allowDeleteTip": "उपयोगकर्ता को फीचर को मिटाने की अनुमति देने के लिए विकल्प; अक्षम करें यदि लेटर मिटाने को समर्थन नहीं करता है",
      "edit": "संशोधन योग्य",
      "editTip": "विजेट में लेयर शामिल करने के लिए विकल्प",
      "label": "लेयर",
      "labelTip": "लेयर का नाम जैसा कि मानचित्र में निर्धारित किया गया है",
      "update": "Geometry संशोधन को अक्षम करें",
      "updateTip": "एक बार रखे जाने के बाद Geometry को हिलाने की क्षमता या Geometry को एक मौजूदा फीचर पर हिलाना अक्षम करने के लिए विकल्प",
      "allowUpdateOnly": "केवल अपडेट",
      "allowUpdateOnlyTip": "केवल मौजूदा फीचर के संशोधन को अनुमति देने के लिए विकल्प, डिफ़ॉल्ट रूप से चयनित होता है और अक्षम किया गया है अगर लेयर नई फीचर बनाने का समर्थन नहीं करती है",
      "fields": "फ़ील्ड्स",
      "fieldsTip": "संशोधित करने के लिए फ़ील्ड को संशोधित करें और स्मार्ट विशेषताओं को निर्धारित करें",
      "description": "विवरण",
      "descriptionTip": "विशेषता पृष्ठ के शीर्ष पर प्रदर्शित करने के लिए पाठ दर्ज करने के लिए विकल्प।"
    },
    "editFieldError": "फील्ड संशोधन और स्मार्ट विशेषता उन लेयरों के लिए उपलब्ध नहीं हैं जो संशोधन योग्य नहीं हैं",
    "noConfigedLayersError": "स्मार्ट संशोधक को एक या एक से अधिक संशोधन योग्य लेयरों की आवश्यकता है"
  },
  "editDescriptionPage": {
    "title": "<b>${layername}</b> के लिए अवलोकन पाठ विशेषता निर्धारित करें "
  },
  "fieldsPage": {
    "title": "<b>${layername}</b> के लिए फ़ील्ड कॉन्फ़िगर करें",
    "description": "एक नई फीचर बनाने से पहले उपयोगकर्ता को एक मान दर्ज करने की अनुमति देने के लिए पूर्व निर्धारित कॉलम का प्रयोग करें। एक लेयर पर स्मार्ट विशेषताओं को सक्रिय करने की प्रक्रिया संपादित करने के लिए बटन का प्रयोग करें। स्मार्ट विशेषताओं को अन्य फील्ड्स में मानों पर आधारित एक फील्ड छिपाने या अक्षम करने की आवश्यकता हो सकती है।",
    "fieldsNotes": "* एक आवश्यक फ़ील्ड है। यदि आप इस फ़ील्ड के लिए प्रदर्शन अचयनित करते हैं, और संशोधित टेम्पलेट इस फ़ील्ड मान को नहीं भरता है, तो आप एक नया रिकार्ड सहेजने में सक्षम नहीं होंगे।",
    "fieldsSettingsTable": {
      "display": "प्रदर्शित करें",
      "displayTip": "निर्धारित करें कि क्या फ़ील्ड दिखाई नहीं दे रही है",
      "edit": "संशोधन योग्य",
      "editTip": "जाँच करें अगर फ़ील्ड विशेषता फॉर्म में मौजूद है",
      "fieldName": "नाम",
      "fieldNameTip": "डेटाबेस में निर्धारित फ़ील्ड का नाम",
      "fieldAlias": "उपनाम",
      "fieldAliasTip": "मानचित्र में निर्धारित फ़ील्ड का नाम",
      "canPresetValue": "प्रीसेट",
      "canPresetValueTip": "मौजूदा फ़ील्ड सूची में फ़ील्ड को दिखाने के लिए विकल्प और उपयोगकर्ता को संशोधन करने से पहले मान निर्धारित करने के लिए अनुमति देता है",
      "actions": "कार्रवाइयाँ",
      "actionsTip": "फ़ील्ड का क्रम बदलें या स्मार्ट विशेषता की स्थापना करें"
    },
    "smartAttSupport": "स्मार्ट विशेषता आवश्यक डेटाबेस फ़ील्ड पर समर्थित नहीं हैं"
  },
  "actionPage": {
    "title": "<b>${fieldname}</b> के लिए स्मार्ट विशेषता क्रियाओं को कॉन्फ़िगर करें",
    "description": "क्रियाएं हमेशा से बंद होती हैं जब तक आप वह मानदंड नहीं निर्दिष्ट करते हैं जिस पर वे शुरू होंगे। क्रियाएं क्रम में प्रसंस्कृत की जाती हैं और केवल एक ही फ़ील्ड पर एक ही क्रिया शुरू की जाएगी। मानदंड निर्धारित करने के लिए मानदंड संशोधित बटन का प्रयोग करें।",
    "actionsSettingsTable": {
      "rule": "कार्रवाई",
      "ruleTip": "जब मानदंड पूरा हो जाता है तब क्रिया की जाती है",
      "expression": "व्यंजक",
      "expressionTip": "निर्धारित मापदंड से SQL फॉर्मेट में परिणामस्वरूप समीकरण",
      "actions": "मानदंड",
      "actionsTip": "नियम के क्रम को बदलें और जब यह शुरू होता है तो मानदंड निर्धारित करें"
    },
    "actions": {
      "hide": "छिपाएँ",
      "required": "अनिवार्य",
      "disabled": "अक्षम किया हुआ"
    }
  },
  "filterPage": {
    "submitHidden": "इस फ़ील्ड के लिए विशेषता डेटा सबमिट करें चाहे छिपा हुआ हो?",
    "title": "${action} नियम के लिए समीकरण कॉन्फ़िगर करें",
    "filterBuilder": "जब रिकॉर्ड निम्न समीकरण से ${any_or_all} मिलता है तब फ़ील्ड पर क्रिया सेट करें",
    "noFilterTip": "नीचे दिए गए टूल का प्रयोग करें, जब क्रिया सक्रिय हो, तो स्टेटमेंट निर्धारित करें।"
  }
});