define({
  "allowSaveAs": "Дозволити експорт",
  "startingState": "Початковий стан:",
  "byUrl": "Пуста модель",
  "byItem": "Попередньо налаштована модель",
  "imageServiceUrl": "URL сервісу зображень",
  "validate": "Перевірити",
  "validating": "Виконується перевірка...",
  "validated": "URL дійсний.",
  "modelName": "Модель",
  "selectModel": "Вибрати",
  "itemSelectorTitle": "Вибрати модель",
  "ok": "OK",
  "cancel": "Скасувати",
  "description1": "Віджет «Моделювання придатності» допомагає знайти найкраще місце розташування для задачі, прогнозувати схильність до ризиків або визначати місце розташування, де швидше за все може статися подія. Цей віджет дозволяє комбінувати та зважувати різні шари, що дозволяє оцінити множину факторів впливу.",
  "description2": "Віджет «Моделювання придатності» використовує швидкий веб-метод зваженого накладення растру для генерування моделей з сервісу. Ви можете почати з чистого стану сервісу зваженого накладення растрів (WRO) або з будь-якої попередньо налаштованої моделі WRO. Виберіть шари, призначте ваги і налаштуйте значення класифікації шарів для аналізу. Далі запустіть розробник, візуалізуйте результати і, якщо необхідно, збережіть результат у вигляді елементу в своїй організації або на порталі.",
  "description3": "Дізнатись більше про моделювання придатності GeoPlanner."
});