define({
  "_widgetLabel": "Перегляд перспективних знімків",
  "locateButtonLabel": "Виберіть точку на основній карті для перегляду перспективних зображень.",
  "clearButtonLabel": "Очистити всю графіку",
  "zoomButtonLabel": "Масштабувати до екстенту перспективних зображень",
  "syncButtonLabel": "Синхронізувати карту надиру",
  "rasterListLabel": "Переглянути доступні перспективні зображення",
  "measureWidgetLabel": "Опції вимірювання",
  "intialScaleLabel": "Вибрати початковий масштаб для перспективних зображень",
  "smallBuildingLabel": "Міська зона: невелика будівля",
  "buildingLabel": "Міська зона: будівля",
  "azimuthChangeNotification": "Немає даних у вибраному напрямку.",
  "noImageNotification": "Зображення у цій області не знайдено. Виберіть інше місце розташування на основній карті."
});