define({
  "page1": {
    "selectToolHeader": "Виберіть метод вибору записів для пакетного оновлення.",
    "selectToolDesc": "Віджет підтримує 3 методи формування вибраного набору записів для оновлення. Можна вибрати тільки один з методів. Якщо потрібно більше одного з цих методів, створіть новий екземпляр віджету.",
    "selectByShape": "Вибрати за областю",
    "shapeTypeSelector": "Клацніть по інструментах, які ви хочете дозволити",
    "shapeType": {
      "point": "Точка",
      "line": "Лінійчата",
      "polyline": "Полілінія",
      "freehandPolyline": "Довільна полілінія",
      "extent": "Екстент",
      "polygon": "Полігон",
      "freehandPolygon": "Довільний полігон"
    },
    "freehandPolygon": "Довільний полігон",
    "selectBySpatQuery": "Вибрати за об’єктом",
    "selectByAttQuery": "Вибрати за об’єктом та пов’язаними об'єктами",
    "selectByQuery": "Вибрати за запитом",
    "toolNotSelected": "Виберіть метод вибору",
    "noDrawToolSelected": "Виберіть щонайменше один інструмент малювання"
  },
  "page2": {
    "layersToolHeader": "Виберіть шари для оновлення та опції інструментів вибору, за наявності.",
    "layersToolDesc": "Метод вибору, відмічений на першій сторінці, буде використовуватися для вибору та оновлення набору шарів, наведених нижче. Якщо відмічено більше одного шару, для оновлення будуть доступні тільки загальні редаговані поля. В залежності від вашого вибору інструменту вибору будуть потрібні додаткові опції.",
    "layerTable": {
      "colUpdate": "Оновити",
      "colLabel": "Шар",
      "colSelectByLayer": "Вибрати за шаром",
      "colSelectByField": "Поле запиту",
      "colhighlightSymbol": "Виділити символ"
    },
    "toggleLayers": "Перемикання видимості шару при відкритті та закритті",
    "noEditableLayers": "Немає редагованих шарів",
    "noLayersSelected": "Виберіть один або декілька шарів перед продовженням."
  },
  "page3": {
    "commonFieldsHeader": "Виберіть поля для пакетного оновлення.",
    "commonFieldsDesc": "Нижче будуть відображатися тільки загальні редаговані поля. Виберіть поля, які необхідно оновити. Якщо одне поле з різних полів має різний домен, буде відображатися та використовуватися тільки один домен.",
    "noCommonFields": "Немає загальних полів",
    "fieldTable": {
      "colEdit": "Редагований",
      "colName": "Назва",
      "colAlias": "Псевдонім",
      "colAction": "Дії"
    }
  },
  "tabs": {
    "selection": "Визначити тип вибору",
    "layers": "Визначити шар(-и) для оновлення",
    "fields": "Визначити поле(-я) для оновлення"
  },
  "errorOnOk": "Заповніть всі параметри перед збереженням конфігурації",
  "next": "Далі",
  "back": "Назад",
  "save": "Зберегти символ",
  "cancel": "Скасувати",
  "ok": "OK",
  "symbolPopup": "Засіб вибору символу",
  "editHeaderText": "Текст для відображення в верхній частині віджета",
  "widgetIntroSelectByArea": "Скористайтесь одним із інструментів нижче для створення вибраного набору об'єктів для оновлення. Якщо рядок має вигляд <font class='maxRecordInIntro'>highlighted</font>, було перевищено максимальну кількість записів.",
  "widgetIntroSelectByFeature": "Скористайтесь інструментом нижче для вибору об'єкту з шару <font class='layerInIntro'>${0}</font>. Цей об'єкт буде використовуватися для вибору та оновлення всіх об'єктів, які перетинаються. Якщо рядок має вигляд <font class='maxRecordInIntro'>highlighted</font>, було перевищено максимальну кількість записів.",
  "widgetIntroSelectByFeatureQuery": "Скористайтесь інструментом нижче для вибору об'єкту з <font class='layerInIntro'>${0}</font>. Атрибут цього об’єкту <font class='layerInIntro'>${1}</font> буде використовуватися для формування запиту для шарів нижче та оновлення підсумкових об’єктів. Якщо рядок має вигляд <font class='maxRecordInIntro'>highlighted</font>, було перевищено максимальну кількість записів.",
  "widgetIntroSelectByQuery": "Введіть значення для створення набору вибору. Якщо рядок має вигляд <font class='maxRecordInIntro'>highlighted</font>, було перевищено максимальну кількість записів."
});