define({
  "page1": {
    "selectToolHeader": "Διαλέξτε μια μέθοδο επιλογής εγγραφών για μαζική ενημέρωση.",
    "selectToolDesc": "Το widget υποστηρίζει 3 μεθόδους για τη δημιουργία ενός επιλεγμένου συνόλου εγγραφών προς ενημέρωση. Μπορείτε να επιλέξετε μόνο μία. Εάν θέλετε περισσότερες από μία μεθόδους, δημιουργήστε μια νέα παρουσία του widget.",
    "selectByShape": "Επιλογή ανά περιοχή",
    "shapeTypeSelector": "Κάντε κλικ στα εργαλεία που επιθυμείτε να επιτρέπονται.",
    "shapeType": {
      "point": "Σημείο",
      "line": "Γραμμή",
      "polyline": "Σύνθετη Γραμμή",
      "freehandPolyline": "Γραμμή ελεύθερης σχεδίασης",
      "extent": "Έκταση",
      "polygon": "Πολύγωνο",
      "freehandPolygon": "Πολύγωνο ελεύθερης σχεδίασης"
    },
    "freehandPolygon": "Πολύγωνο ελεύθερης σχεδίασης",
    "selectBySpatQuery": "Επιλογή ανά στοιχείο",
    "selectByAttQuery": "Επιλογή ανά στοιχείο και συσχατιζόμενα στοιχεία",
    "selectByQuery": "Επιλογή ανά ερώτημα",
    "toolNotSelected": "Επιλέξτε μια μέθοδο επιλογής",
    "noDrawToolSelected": "Επιλέξτε τουλάχιστον ένα εργαλείο σχεδίασης."
  },
  "page2": {
    "layersToolHeader": "Επιλέξτε τα θεματικά πεδία για ενημέρωση και επιλογές του Εργαλείου επιλογής, εάν υπάρχουν.",
    "layersToolDesc": "Η μέθοδος επιλογής που επιλέξατε στη σελίδα ένα θα χρησιμοποιηθεί για την επιλογή και την ενημέρωση ενός συνόλου θεματικών πεδίων που παρατίθενται παρακάτω.  Εάν επιλέξετε περισσότερα από ένα θεματικά επίπεδα, μόνο τα κοινά επεξεργάσιμα πεδία θα είναι διαθέσιμα για ενημέρωση.  Ανάλογα με το εργαλείο επιλογής που επιλέγετε, θα απαιτηθούν πρόσθετες ρυθμίσεις.",
    "layerTable": {
      "colUpdate": "Ενημέρωση",
      "colLabel": "Θεματικό επίπεδο",
      "colSelectByLayer": "Επιλογή ανά θεματικό επίπεδο",
      "colSelectByField": "Πεδίο ερωτήματος",
      "colhighlightSymbol": "Σύμβολο επισήμανσης"
    },
    "toggleLayers": "Εναλλαγή της ορατότητας των θεματικών επιπέδων κατά το άνοιγμα και το κλείσιμο",
    "noEditableLayers": "Δεν υπάρχουν θεματικά επίπεδα με δυνατότητα επεξεργασίας",
    "noLayersSelected": "Επιλέξετε ένα ή περισσότερα θεματικά επίπεδα προτού συνεχίσετε."
  },
  "page3": {
    "commonFieldsHeader": "Επιλέξτε τα πεδία για μαζική ενημέρωση.",
    "commonFieldsDesc": "Μόνο τα κοινά θεματικά επίπεδα με δυνατότητα επεξεργασίας θα εμφανιστούν παρακάτω.  Επιλέξτε τα πεδία που θέλετε να ενημερώσετε.  Εάν το ίδιο πεδίο από διαφορετικά θεματικά επίπεδα έχει διαφορετικούς τομείς, μόνο ένας τομέας θα εμφανιστεί και θα χρησιμοποιηθεί.",
    "noCommonFields": "Δεν υπάρχουν κοινά πεδία",
    "fieldTable": {
      "colEdit": "Επεξεργάσιμο",
      "colName": "Όνομα",
      "colAlias": "Ψευδώνυμο",
      "colAction": "Ενέργειες"
    }
  },
  "tabs": {
    "selection": "Ορισμός τύπου επιλογής",
    "layers": "Ορισμός θεματικών επιπέδων για ενημέρωση",
    "fields": "Ορισμός πεδίων για ενημέρωση"
  },
  "errorOnOk": "Συμπληρώστε όλες τις παραμέτρους προτού αποθηκεύσετε τη διαμόρφωση",
  "next": "ΕΠΟΜΕΝΟ",
  "back": "Πίσω",
  "save": "Αποθήκευση συμβόλου",
  "cancel": "Ακύρωση",
  "ok": "OK",
  "symbolPopup": "Επιλογέας συμβόλων",
  "editHeaderText": "Κείμενο που θα εμφανίζεται στο επάνω μέρος του widget",
  "widgetIntroSelectByArea": "Χρησιμοποιήστε ένα από τα παρακάτω εργαλεία για να δημιουργήσετε ένα επιλεγμένο σύνολο στοιχείων προς ενημέρωση. Αν <font class='maxRecordInIntro'>επισημαίνεται</font> η γραμμή, τότε έχετε υπερβεί τον ανώτατο αριθμό εγγραφών.",
  "widgetIntroSelectByFeature": "Χρησιμοποιήστε το παρακάτω εργαλείο για να επιλέξετε ένα στοιχείο από το θεματικό επίπεδο <font class='layerInIntro'>${0}</font>. Το στοιχείο αυτό θα χρησιμοποιηθεί για την επιλογή και την ενημέρωση όλων των τεμνόμενων στοιχείων. Αν <font class='maxRecordInIntro'>επισημαίνεται</font> η γραμμή, τότε έχετε υπερβεί τον ανώτατο αριθμό εγγραφών.",
  "widgetIntroSelectByFeatureQuery": "Χρησιμοποιήστε το παρακάτω εργαλείο για να επιλέξετε ένα στοιχείο από το <font class='layerInIntro'>${0}</font>. Το γνώρισμα <font class='layerInIntro'>${1}</font> του στοιχείου αυτού θα χρησιμοποιηθεί για την υποβολή ερωτήματος όσον αφορά τα παρακάτω θεματικά επίπεδα και την ενημέρωση των στοιχείων που θα προκύψουν. Αν <font class='maxRecordInIntro'>επισημαίνεται</font> η γραμμή, τότε έχετε υπερβεί τον ανώτατο αριθμό εγγραφών.",
  "widgetIntroSelectByQuery": "Καταχωρίστε μια τιμή για να δημιουργηθεί ένα σύνολο επιλογών. Αν <font class='maxRecordInIntro'>επισημαίνεται</font> η γραμμή, τότε έχετε υπερβεί τον ανώτατο αριθμό εγγραφών."
});