define({
  "configText": "Ορίστε παρακάτω τις ομάδες φίλτρων",
  "labels": {
    "groupName": "Ορισμένο όνομα φίλτρου:",
    "groupDesc": "Περιγραφή:",
    "groupOperator": "Προκαθορισμένος τελεστής:",
    "groupDefault": "Προκαθορισμένη τιμή:"
  },
  "buttons": {
    "addNewGroup": "Προσθήκη νέας ομάδας",
    "addLayer": "Προσθήκη θεματικού επιπέδου"
  },
  "inputs": {
    "groupName": "Δώστε στην ομάδα σας όνομα",
    "groupDesc": "Περιγραφή για την ομάδα σας",
    "groupDefault": "Εισαγάγετε μια προκαθορισμένη τιμή",
    "simpleMode": "Έναρξη σε απλή προβολή",
    "optionsMode": "Απόκρυψη επιλογών widget",
    "optionOR": "Ή",
    "optionAND": "ΚΑΙ",
    "optionEQUAL": "ΙΣΟΥΤΑΙ ΜΕ",
    "optionNOTEQUAL": "ΔΕΝ ΙΣΟΥΤΑΙ ΜΕ",
    "optionGREATERTHAN": "ΜΕΓΑΛΥΤΕΡΟ ΑΠΟ",
    "optionGREATERTHANEQUAL": "ΜΕΓΑΛΥΤΕΡΟ ΑΠΟ Ή ΙΣΟ ΜΕ",
    "optionLESSTHAN": "ΜΙΚΡΟΤΕΡΟ ΑΠΟ",
    "optionLESSTHANEQUAL": "ΜΙΚΡΟΤΕΡΟ ΑΠΟ Ή ΙΣΟ ΜΕ",
    "optionSTART": "ΑΡΧΙΖΕΙ ΜΕ",
    "optionEND": "ΤΕΛΕΙΩΝΕΙ ΣΕ",
    "optionLIKE": "ΠΕΡΙΕΧΕΙ",
    "optionNOTLIKE": "ΔΕΝ ΠΕΡΙΕΧΕΙ",
    "optionNONE": "ΚΑΝΕΝΑ"
  },
  "tables": {
    "layer": "Θεματικά επίπεδα",
    "field": "Πεδία",
    "value": "Χρησιμοποιήστε την τιμή",
    "action": "Διαγραφή"
  },
  "popup": {
    "label": "Επιλέξτε μια τιμή"
  },
  "errors": {
    "noGroups": "Χρειάζεστε τουλάχιστον μία ομάδα.",
    "noGroupName": "Λείπουν ένα ή περισσότερα ονόματα ομάδων.",
    "noDuplicates": "Ένα ή περισσότερα ονόματα ομάδων είναι διπλότυπα.",
    "noRows": "Χρειάζεστε τουλάχιστον μία σειρά στον πίνακα.",
    "noLayers": "Δεν υπάρχουν θεματικά επίπεδα στο χάρτη σας."
  },
  "picker": {
    "description": "Χρησιμοποιήστε αυτή τη φόρμα για να βρείτε μια προκαθορισμένη τιμή για αυτή την ομάδα.",
    "layer": "Επιλέξτε θεματικό επίπεδο",
    "field": "Επιλέξτε πεδίο",
    "value": "Επιλέξτε τιμή"
  }
});