define({
  "page1": {
    "selectToolHeader": "Виберіть метод вибору записів для пакетного оновлення.",
    "selectToolDesc": "Віджет підтримує 3 методи формування вибраного набору записів для оновлення. Можна вибрати тільки один з методів. Якщо потрібно більше одного з цих методів, створіть новий екземпляр віджету.",
    "selectByShape": "Вибрати за областю",
    "selectBySpatQuery": "Вибрати за об’єктом",
    "selectByAttQuery": "Вибрати за об’єктом та пов’язаними об'єктами",
    "selectByQuery": "Вибрати за запитом",
    "toolNotSelected": "Виберіть метод вибору"
  },
  "page2": {
    "layersToolHeader": "Виберіть шари для оновлення та опції інструментів вибору, за наявності.",
    "layersToolDesc": "Метод вибору, відмічений на першій сторінці, буде використовуватися для вибору та оновлення набору шарів, наведених нижче. Якщо відмічено більше одного шару, для оновлення будуть доступні тільки загальні редаговані поля. В залежності від вашого вибору інструменту вибору будуть потрібні додаткові опції.",
    "layerTable": {
      "colUpdate": "Оновити",
      "colLabel": "Шар",
      "colSelectByLayer": "Вибрати за шаром",
      "colSelectByField": "Поле запиту",
      "colhighlightSymbol": "Виділити символ"
    },
    "toggleLayers": "Перемикання видимості шару при відкритті та закритті",
    "noEditableLayers": "Немає редагованих шарів",
    "noLayersSelected": "Виберіть один або декілька шарів перед продовженням."
  },
  "page3": {
    "commonFieldsHeader": "Виберіть поля для пакетного оновлення.",
    "commonFieldsDesc": "Нижче будуть відображатися тільки загальні редаговані поля. Виберіть поля, які необхідно оновити. Якщо одне поле з різних полів має різний домен, буде відображатися та використовуватися тільки один домен.",
    "noCommonFields": "Немає загальних полів",
    "fieldTable": {
      "colEdit": "Редагований",
      "colName": "Назва",
      "colAlias": "Псевдонім",
      "colAction": "Дії"
    }
  },
  "tabs": {
    "selection": "Визначити тип вибору",
    "layers": "Визначити шар(-и) для оновлення",
    "fields": "Визначити поле(-я) для оновлення"
  },
  "errorOnOk": "Заповніть всі параметри перед збереженням конфігурації",
  "next": "Далі",
  "back": "Назад",
  "save": "Зберегти символ",
  "cancel": "Скасувати",
  "ok": "OK",
  "symbolPopup": "Засіб вибору символу"
});