define({
  "layersPage": {
    "title": "Επιλέξτε ένα πρότυπο για τη δημιουργία στοιχείων",
    "generalSettings": "Γενικές ρυθμίσεις",
    "layerSettings": "Ρυθμίσεις θεματικού επιπέδου",
    "editDescription": "Δώστε το κείμενο εμφάνισης για το πλαίσιο επεξεργασίας",
    "editDescriptionTip": "Αυτό το κείμενο εμφανίζεται επάνω από το Εργαλείο επιλογής προτύπου, αφήστε το κενό για να μην εμφανίζεται κείμενο.",
    "promptOnSave": "Μήνυμα για αποθήκευση των μη αποθηκευμένων αλλαγών όταν είναι κλειστή η φόρμα ή όταν γίνεται μετάβαση στην επόμενη εγγραφή.",
    "promptOnSaveTip": "Εμφανίζει μήνυμα όταν ο χρήσης πατά κλείσιμο ή μεταβαίνει στην επόμενη επεξεργάσιμη εγγραφή εφόσον το τρέχον στοιχείο έχει μη αποθηκευμένες αλλαγές.",
    "promptOnDelete": "Να απαιτείται επιβεβαίωση για τη διαγραφή εγγραφής.",
    "promptOnDeleteTip": "Εμφανίζει μήνυμα όταν ο χρήστης πατά διαγραφή για να επιβεβαιωθεί η ενέργεια.",
    "removeOnSave": "Κατάργηση στοιχείου από την επιλογή με την αποθήκευση.",
    "removeOnSaveTip": "Επιλογή για διαγραφή του στοιχείου από το σύνολο της επιλογής κατά την αποθήκευση της εγγραφής. Εάν αυτή είναι η μοναδική επιλεγμένη εγγραφή, το πλαίσιο επιστρέφει στη σελίδα προτύπου.",
    "useFilterEditor": "Χρήση φίλτρου προτύπου στοιχείων",
    "useFilterEditorTip": "Επιλογή για χρήση του Εργαλείου επιλογής προτύπου φίλτρου το οποίο παρέχει τη δυνατότητα προβολής των προτύπων ενός θεματικού επιπέδου ή αναζήτηση των προτύπων με βάση το όνομα.",
    "listenToGroupFilter": "Εφαρμογή τιμών φίλτρου από το widget Φίλτρο ομάδας στα προκαθορισμένα πεδία",
    "listenToGroupFilterTip": "Όταν εφαρμόζεται φίλτρο στο widget φίλτρου ομάδας, εφαρμόστε την τιμή σε ένα αντίστοιχο πεδίο στη λίστα προκαθορισμένων τιμών.",
    "keepTemplateActive": "Διατήρηση ενεργού του επιλεγμένου προτύπου",
    "keepTemplateActiveTip": "Όταν εμφανίζεται ο επιλογέας προτύπων, αν κάποιο πρότυπο είχε επιλεγεί προηγουμένως, επιλέξτε το ξανά.",
    "layerSettingsTable": {
      "allowDelete": "Να επιτρέπεται η διαγραφή",
      "allowDeleteTip": "Επιλογή που επιτρέπει στο χρήστη να διαγράψει ένα στοιχείο. Απενεργοποιημένη εάν το θεματικό επίπεδο δεν υποστηρίζει διαγραφή.",
      "edit": "Επεξεργάσιμο",
      "editTip": "Επιλογή για να συμπεριληφθεί το θεματικό επίπεδο στο widget",
      "label": "Θεματικό επίπεδο",
      "labelTip": "Το όνομα του θεματικού επιπέδου όπως ορίζεται στο χάρτη",
      "update": "Απενεργοποίηση επεξεργασίας γεωμετρικού τύπου",
      "updateTip": "Επιλογή για την απενεργοποίηση της δυνατότητας μετακίνησης του γεωμετρικού τύπου μετά την τοποθέτησή του ή μετακίνησης του γεωμετρικού τύπου σε υπάρχον στοιχείο",
      "allowUpdateOnly": "Μόνο ενημέρωση",
      "allowUpdateOnlyTip": "Επιλογή που επιτρέπει μόνο την τροποποίηση των υπαρχόντων στοιχείων. Ενεργοποιημένη από προεπιλογή και απενεργοποιημένη εάν το θεματικό επίπεδο δεν υποστηρίζει τη δημιουργία νέων στοιχείων.",
      "fields": "Πεδία",
      "fieldsTip": "Τροποποίηση των πεδίων που θα υποστούν επεξεργασία και ορισμός έξυπνων γνωρισμάτων",
      "description": "Περιγραφή",
      "descriptionTip": "Επιλογή για την εισαγωγή κειμένου που θα εμφανίζεται στην κορυφή της σελίδας γνωρισμάτων."
    },
    "editFieldError": "Τροποποιήσεις πεδίων και έξυπνα γνωρίσματα δεν είναι διαθέσιμα σε θεματικά επίπεδα χωρίς δυνατότητα επεξεργασίας",
    "noConfigedLayersError": "Το Εργαλείο έξυπνης επεξεργασίας απαιτεί ένα ή περισσότερα θεματικά επίπεδα με δυνατότητα επεξεργασίας"
  },
  "editDescriptionPage": {
    "title": "Ορίστε το κείμενο επισκόπησης γνωρίσματος για <b>${layername}</b> "
  },
  "fieldsPage": {
    "title": "Διαμορφώστε πεδία για <b>${layername}</b>",
    "description": "Χρησιμοποιήστε τη στήλη Προκαθορισμένα για να επιτρέπεται στο χρήστη να καταχωρεί μια τιμή πριν τη δημιουργία νέου στοιχείου. Χρησιμοποιήστε το κουμπί επεξεργασίας Ενέργειες ώστε να ενεργοποιηθούν τα έξυπνα γνωρίσματα σε ένα θεματικό επίπεδο. Με τα έξυπνα γνωρίσματα είναι δυνατή η εμφάνιση, η απόκρυψη ή η απενεργοποίηση ενός πεδίου με βάση τις τιμές σε άλλα πεδία.",
    "fieldsNotes": "* είναι απαιτούμενο πεδίο. Αν δεν επιλέξετε Εμφάνιση για αυτό το πεδίο, και το πρότυπο επεξεργασίας δεν συμπληρώνει την τιμή του πεδίου, δεν θα μπορείτε να αποθηκεύσετε μια νέα εγγραφή.",
    "fieldsSettingsTable": {
      "display": "Εμφάνιση",
      "displayTip": "Καθορίζει εάν το πεδίο θα είναι ορατό",
      "edit": "Επεξεργάσιμο",
      "editTip": "Επιλέξτε το εάν το πεδίο είναι ορατό στη φόρμα γνωρισμάτων",
      "fieldName": "Όνομα",
      "fieldNameTip": "Το όνομα του πεδίου όπως ορίζεται στη βάση δεδομένων",
      "fieldAlias": "Ψευδώνυμο",
      "fieldAliasTip": "Το όνομα του πεδίου που είναι ορισμένο στο χάρτη",
      "canPresetValue": "Προκαθορισμένα",
      "canPresetValueTip": "Επιλογή για να εμφανίζεται το πεδίο στη λίστα προκαθορισμένων πεδίων και να μπορεί ο χρήστης να ορίσει την τιμή πριν την επεξεργασία",
      "actions": "Ενέργειες",
      "actionsTip": "Αλλάξτε τη σειρά των πεδίων ή ορίστε έξυπνα γνωρίσματα"
    },
    "smartAttSupport": "Τα έξυπνα γνωρίσματα δεν υποστηρίζονται σε απαιτούμενα πεδία βάσης δεδομένων"
  },
  "actionPage": {
    "title": "Διαμορφώστε τις ενέργειες έξυπνου γνωρίσματος για <b>${fieldname}</b>",
    "description": "Οι ενέργειες είναι πάντα απενεργοποιημένες εκτός εάν ορίσετε τα κριτήρια βάσει των οποίων θα ενεργοποιούνται. Οι ενέργειες θα εκτελούνται με τη σειρά και μόνο μία ενέργεια θα ενεργοποιείται ανά πεδίο. Χρησιμοποιήστε το κουμπί επεξεργασίας Κριτήρια για να ορίσετε τα κριτήρια.",
    "actionsSettingsTable": {
      "rule": "Ενέργεια",
      "ruleTip": "Η ενέργεια που θα εκτελείται όταν πληρούνται τα κριτήρια",
      "expression": "Έκφραση",
      "expressionTip": "Η έκφραση που προκύπτει σε μορφή SQL από τα ορισμένα κριτήρια",
      "actions": "Κριτήρια",
      "actionsTip": "Αλλάξτε τη σειρά του κανόνα και ορίστε τα κριτήρια για την ενεργοποίηση"
    },
    "actions": {
      "hide": "Απόκρυψη",
      "required": "Απαιτείται",
      "disabled": "Απενεργοποιήθηκε"
    }
  },
  "filterPage": {
    "submitHidden": "Να υποβάλλονται δεδομένα γνωρίσματος για το πεδίο ακόμη και όταν δεν εμφανίζεται;",
    "title": "Διαμόρφωση παράστασης για τον κανόνα ${action}",
    "filterBuilder": "Ορίστε ενέργεια για το πεδίο όταν η εγγραφή συμφωνεί με ${any_or_all} τις παρακάτω εκφράσεις",
    "noFilterTip": "Χρησιμοποιώντας τα εργαλεία παρακάτω, ορίστε την πρόταση που θα ισχύει όταν η ενέργεια είναι ενεργή."
  }
});