define({
  "layersPage": {
    "title": "בחר תבנית בכדי ליצור ישויות",
    "generalSettings": "הגדרות כלליות",
    "layerSettings": "הגדרות שכבה",
    "editDescription": "ספק טקסט תצוגה עבור חלונית העריכה",
    "editDescriptionTip": "טקסט זה מוצג מעל לבורר התבניות. אם אינך מעוניין להציג טקסט, השאר ריק.",
    "promptOnSave": "עם סגירת טופס או מעבר לרשומה הבאה, שאל אם לשמור פעולות עריכה שלא נשמרו.",
    "promptOnSaveTip": "הצג הודעה כאשר משתמש לוחץ לסגירה או מנווט לרשומה הבאה שניתנת לעריכה, אם בוצעו בישות הנוכחית פעולות עריכה שלא נשמרו.",
    "promptOnDelete": "בקש אישור בעת מחיקת רשומה.",
    "promptOnDeleteTip": "כאשר משתמש לוחץ למחיקה, בקש אישור לביצוע הפעולה.",
    "removeOnSave": "הסר ישות מהבחירה בעת שמירה.",
    "removeOnSaveTip": "אפשרות להסרת הישות מהבחירה שנקבעה בעת שמירת הרשומה. אם זו הרשומה היחידה שנבחרה, החלונית חוזרת לדף התבניות.",
    "useFilterEditor": "השתמש בפילטר של תבניות ישות",
    "useFilterEditorTip": "אפשרות להשתמש בבורר תבניות הסינון שמאפשר להציג תבניות של שכבה יחידה או לחפש תבניות לפי שם.",
    "listenToGroupFilter": "החל ערכי מסננים מהווידג'ט 'מסנן קבוצתי' על השדות המוגדרים מראש",
    "listenToGroupFilterTip": "כאשר מסנן מיושם בווידג'ט 'מסנן קבוצתי', החל את הערך על שדה תואם ברשימת הערכים המוגדרים מראש.",
    "keepTemplateActive": "השאר את התבנית שנבחרה במצב פעיל",
    "keepTemplateActiveTip": "כאשר בורר התבניות מוצג, אם תבנית מסוימת נבחרה קודם לכן, בחר אותה מחדש.",
    "layerSettingsTable": {
      "allowDelete": "אפשר מחיקה",
      "allowDeleteTip": "אפשרות להתיר למשתמש למחוק ישות; מושבת אם השכבה לא תומכת במחיקה",
      "edit": "ניתן לעריכה",
      "editTip": "אפשרות לכלול את השכבה בווידג'יט",
      "label": "שכבה",
      "labelTip": "שם השכבה כפי שמוגדר במפה",
      "update": "השבת עריכת גיאומטריה",
      "updateTip": "אפשרות להשבית את היכולת להזזת הגיאומטריה לאחר הצבתה, או להזזת הגיאומטריה בישות קיימת",
      "allowUpdateOnly": "עדכון בלבד",
      "allowUpdateOnlyTip": "אפשרות להתרת ביצוע פעולות של שינוי בלבד בישויות קיימות; מופעל כברירת מחדל ומושבת אם השכבה לא תומכת ביצירת תכונות חדשות",
      "fields": "שדות",
      "fieldsTip": "שנה את השדות שמיועדים לעריכה, והגדר ישויות חכמות",
      "description": "תאור",
      "descriptionTip": "אפשרות להזין טקסט שיוצג בחלק העליון של דף המאפיינים."
    },
    "editFieldError": "שינויים בשדות וישויות חכמות אינם זמינים בשכבות שלא ניתנות לעריכה",
    "noConfigedLayersError": "'עורך חכם' דורש שכבה ניתנת לעריכה אחת לפחות"
  },
  "editDescriptionPage": {
    "title": "הגדר טקסט סקירה כללית לישויות עבור <b>${layername}</b> "
  },
  "fieldsPage": {
    "title": "הגדר שדות עבור <b>${layername}</b>",
    "description": "השתמש בעמודה 'קבועה' כדי לאפשר למשתמש להזין ערך לפני יצירת ישות חדשה. השתמש בלחצן 'עריכת פעולות' להפעלת ישויות חכמות בשכבה. ישויות חכמות יכולות לבקש, להסתיר או להשבית שדה על סמך ערכים בשדות אחרים.",
    "fieldsNotes": "* מציין שדה חובה. אם אתה מבטל את הסימון להצגה עבור השדה הזה ותבנית העריכה לא משלימה את ערך השדה, לא תוכל לשמור רשומה חדשה.",
    "fieldsSettingsTable": {
      "display": "תצוגה",
      "displayTip": "קבע אם השדה אינו נראה",
      "edit": "ניתן לעריכה",
      "editTip": "הפעל אם השדה קיים בטופס המאפיינים",
      "fieldName": "שם",
      "fieldNameTip": "שם השדה מוגדר במסד הנתונים",
      "fieldAlias": "כינוי",
      "fieldAliasTip": "שם השדה מוגדר במפה",
      "canPresetValue": "קבוע מראש",
      "canPresetValueTip": "אפשרות להצגת השדה ברשימת השדות המתוכנתים, ולהתיר למשתמש להגדיר ערך לפני העריכה",
      "actions": "פעולות",
      "actionsTip": "שנה את סדר השדות או הגדר מאפיינים חכמים"
    },
    "smartAttSupport": "מאפיינים חכמים לא נתמכים בשדות חובה של מסדי נתונים"
  },
  "actionPage": {
    "title": "הגדר את פעולות המאפיינים החכמים עבור <b>${fieldname}</b>",
    "description": "הפעולות תמיד מושבתות, למעט אם אתה מציין את הקריטריונים להפעלתן. הפעולות מעובדות לפי הסדר ורק פעולה אחת תופעל לכל שדה. השתמש בלחצן 'עריכת קריטריונים' להגדרת הקריטריונים.",
    "actionsSettingsTable": {
      "rule": "פעולה",
      "ruleTip": "הפעולה מתבצעת כשהקריטריונים מתמלאים",
      "expression": "ביטוי",
      "expressionTip": "הביטוי שמתקבל בפורמט SQL מהקריטריונים שהוגדרו",
      "actions": "קריטריונים",
      "actionsTip": "שנה את סדר הכלל והגדר את הקריטריונים להפעלתו"
    },
    "actions": {
      "hide": "הסתר",
      "required": "נדרש",
      "disabled": "לא פעיל"
    }
  },
  "filterPage": {
    "submitHidden": "לשלוח את נתוני המאפיינים עבור שדה זה גם אם הם מוסתרים?",
    "title": "הגדר ביטוי עבור החוק ${action}",
    "filterBuilder": "הגדר פעולה בשדה כאשר הרשומה תואמת ל-${any_or_all} מהביטויים הבאים",
    "noFilterTip": "באמצעות הכלים שלהלן, הגדר את ההצהרה ליישום הפעולה."
  }
});