define({
  "layersPage": {
    "title": "เลือกเทมเพลตเพื่อสร้างฟีเจอร์",
    "generalSettings": "ตั้งค่าทั่วไป",
    "layerSettings": "การตั้งค่าชั้นข้อมูล",
    "editDescription": "ให้แสดงข้อความสำหรับพาเนลที่แก้ไข",
    "editDescriptionTip": "ข้อความนี้จะปรากฏเหนือเทมเพลต ให้ปล่อยว่างไว้สำหรับข้อความใดๆ",
    "promptOnSave": "พร้อมที่จะบันทึกการแก้ไขไม่ได้บันทึกไว้เมื่อฟอร์มถูกปิดหรือเปลี่ยนไประเบียนถัดไป",
    "promptOnSaveTip": "แสดงการแจ้งเตือนเมื่อผู้ใช้คลิกปิดหรือนำทางไปยังเรคคอร์ทที่สามารถแก้ไขได้ต่อไป เมื่อฟีเจอร์ปัจจุบันมีการแก้ไขที่ไม่ได้บันทึก",
    "promptOnDelete": "ต้องการการยืนยันเมื่อลบเรคคอร์ท",
    "promptOnDeleteTip": "แสดงความพร้อมเมื่อผู้ใช้คลิกลบเพื่อยืนยันดำเนินการ",
    "removeOnSave": "ลบฟีเจอร์จากที่เลือกไว้เมื่อบันทึก",
    "removeOnSaveTip": "ตัวเลือกในการลบฟีเจอร์จากการตั้งค่าตัวเลือกจะถูกบันทึกไว้ ถ้ามันเป็นเพียงบันทึกการเลือกเรคคอร์ท พาเนลจะเปลี่ยนกลับไปที่หน้าเทมเพลต",
    "useFilterEditor": "ใช้ตัวกรองฟีเจอร์เทมเพลต",
    "useFilterEditorTip": "ตัวเลือกที่จะใช้ตัวเลือกกรองฟีเจอร์เทมเพลตซึ่งมีความสามารถในการดูหนึ่งชั้นข้อมูลเทมพลตหรือค้นหาเทมเพลตโดยใช้ชื่อ",
    "listenToGroupFilter": "ปรับใช้ค่าการกรองจากกลุ่มวิดเจ็ตตัวกรองไปยังฟิลด์ที่ตั้งไว้ล่วงหน้า",
    "listenToGroupFilterTip": "เมื่อตัวกรองถูกใช้กับหลุ่มวิดเจ็ตตัวกรอง ใช้ค่าที่สอดต้องกับฟิลด์ในลิสต์ที่เตรียมไว้ล่วงหน้า",
    "keepTemplateActive": "ทำให้เท็มเพลตที่เลือกใช้งานได้",
    "keepTemplateActiveTip": "เมื่อเท็มเพลตที่เลือกถูกแสดงขึ้น หากมีการเลือกเท็มเพลตไว้ ให้เลือกอีกครั้งหนึ่ง",
    "layerSettingsTable": {
      "allowDelete": "อนุญาตให้ลบ",
      "allowDeleteTip": "ตัวเลือกเพื่ออนุญาตให้ผู้ใช้ลบฟีเจอร์  ไม่สามารถใช้งานได้หากชั้นข้อมูลไม่รองรับการลบ",
      "edit": "ที่สามารถแก้ไขได้",
      "editTip": "ตัวเลือกเพื่อรวมชั้นข้อมูลในวิดเจต",
      "label": "ชั้นข้อมูล",
      "labelTip": "ชื่อของชั้นข้อมูลเหมือนที่ระบุในแผนที่",
      "update": "ไม่สามารถใช้งานการแก้ไขด้านเรขาคณิตได้",
      "updateTip": "ตัวเลือกเพื่อที่จะปิดการใช้งานความสามารถในการย้ายคุณสมบัติเรขาคณิตที่วางอยู่ หรือย้ายคุณสมบัติทางเรขาคณิตในฟีเจอร์ที่มีอยู่",
      "allowUpdateOnly": "เฉพาะการอัพเดทเท่านั้น",
      "allowUpdateOnlyTip": "ตัวเลือกที่จะอนุญาตให้แก้ไขเฉพาะข้อมูลที่มีอยู่แล้ว ค่าเริ่มต้นจะเปิดไว้ แต่จะปิดถ้าชั้นข้อมูลนั้นไม่สนับสนุนการสร้างข้อมูลใหม่",
      "fields": "ฟิลด์",
      "fieldsTip": "การปรับฟิลด์ให้แก้ไข และกำหนดสมาร์ทแอตทริบิวต์",
      "description": "คำอธิบาย",
      "descriptionTip": "ตัวเลือกในการป้อนข้อความที่จะแสดงด้านบนของหน้าแอตทริบิวต์"
    },
    "editFieldError": "การปรับเปลี่ยนฟิลด์และสมาร์ทแอตทริบิวต์ไม่สามารถใช้ได้กับเลชั้นข้อมูลที่ไม่สามารถแก้ไขได้",
    "noConfigedLayersError": "สมาร์ทเอดิเตอร์ต้องใช้งานกับชั้นข้อมูลที่สามารถแก้ไขได้"
  },
  "editDescriptionPage": {
    "title": "กำหนดข้อความบรรยายภาพรวมของแอตทริบิวต์ <b>${layername}</b> "
  },
  "fieldsPage": {
    "title": "กำหนดค่าฟิลด์สำหรับ<b>${layername}</b>",
    "description": "ใช้คอลัมน์ที่ตั้งไว้ล่วงหน้าเพื่อให้ผู้ใช้สามารถป้อนค่าก่อนที่จะมีการสร้างคุณลักษณะใหม่ ใช้ปุ่มการดำเนินการแก้ไขเพื่อเปิดใช้งานสมาร์ทแอตทริบิวต์บนชั้น คุณลักษณะที่สมาร์ทจะต้องซ่อนหรือปิดการใช้ข้อมูลซึ่งเป็นไปตามค่าที่อยู่ในฟิลด์อื่น ๆ",
    "fieldsNotes": "* เป็นฟิลด์บังคับ หากคุณยกเลิกการเลือกแสดงผลสำหรับฟิลด์นี้ และแก้ไขแม่แบบ จะไม่มีการเติมค่าให้กับฟิลด์นี้ ที่คุณจะไม่สามารถบันทึกข้อมูลใหม่ได้",
    "fieldsSettingsTable": {
      "display": "แสดงผล",
      "displayTip": "ตรวจสอบว่าฟิลด์นี้ที่ไม่สามารถมองเห็นได้",
      "edit": "ที่สามารถแก้ไขได้",
      "editTip": "ตรวจสอบว่าถ้าฟิลด์นี้แสดงในฟอร์มของแอตทริบิวต์",
      "fieldName": "ชื่อ",
      "fieldNameTip": "ชื่อของฟิลด์ที่กำหนดไว้ในฐานข้อมูล",
      "fieldAlias": "ชื่อย่อ",
      "fieldAliasTip": "ชื่อฟิลด์ที่กำหนดไว้ในแผนที่",
      "canPresetValue": "ตั้งล่วงหน้า",
      "canPresetValueTip": "ตัวเลือกที่จะแสดงฟิลด์ในรายการฟิลด์ที่กำหนดไว้ล่วงหน้า และอนุญาตให้ผู้ใช้สามารถกำหนดค่าก่อนที่จะมีการแก้ไข",
      "actions": "การดำเนินการ",
      "actionsTip": "เปลี่ยนลำดับของฟิลด์ หรือตั้งค่าสมาร์ทแอตทริบิวต์"
    },
    "smartAttSupport": "สมาร์ทแอตทริบิวต์ยังไม่ได้รับการสนับสนุนในฟิลด์ของฐานข้อมูลนี้"
  },
  "actionPage": {
    "title": "การกำหนดสมาร์ทแอตทริบิวต์สำหรับ <b>${fieldname}</b>",
    "description": "การดำเนินการนี้ จะปิดจนกว่าคุณจะระบุเงื่อนไขที่ทำให้ทำงาน การดำเนินการทำงานตามลำดับ และจะทำได้เพียงหนึ่งการกระทำต่อแต่ละฟิลด์ ใช้ปุ่มแก้ไขเกณฑ์ ในการกำหนดเกณฑ์",
    "actionsSettingsTable": {
      "rule": "ปฏิบัติ",
      "ruleTip": "การดำเนินการทำไดเมื่อถูกต้องตามเกณฑ์",
      "expression": "สูตรคำนวณ",
      "expressionTip": "ผลลัพธ์จากสมการในรูปแบบ SQL จากเกณฑ์ที่กำหนดไว้",
      "actions": "เกณฑ์",
      "actionsTip": "เปลี่ยนลำดับของกฎ และกำหนดเกณฑ์เมื่อมันถูกเรียก"
    },
    "actions": {
      "hide": "ซ่อน",
      "required": "ต้องการ",
      "disabled": "ปิดการใช้งาน"
    }
  },
  "filterPage": {
    "submitHidden": "ส่งข้อมูลแอตทริบิวต์สำหรับข้อมูลนี้ แม้ในขณะที่ฟิลด์ถูกซ่อนอยู่?",
    "title": "กำหนดเงื่อนไขสำหรับ ${action} กฎ",
    "filterBuilder": "กำหนดการกระทำเมื่อค่าในฟิลด์ตรง ${any_or_all} of จากสมการดังต่อไปนี้",
    "noFilterTip": "ใช้เครื่องมือที่ด้านล่างกำหนดคำสั่งสำหรับการดำเนินการเมื่อมีการใช้งาน"
  }
});