define({
  "_widgetLabel": "Просмотр перспективных снимков",
  "locateButtonLabel": "Выберите точку на основной карте для просмотра перспективных снимков.",
  "clearButtonLabel": "Очистить всю графику",
  "zoomButtonLabel": "Приблизить к экстенту перспективного изображения",
  "syncButtonLabel": "Синхронизация карты надира",
  "rasterListLabel": "Просмотр доступных перспективных изображений",
  "measureWidgetLabel": "Измерить высоту",
  "intialScaleLabel": "Задать начальный масштаб перспективных изображений",
  "smallBuildingLabel": "Городская застройка: небольшие здания",
  "buildingLabel": "Городская застройка: здания",
  "azimuthChangeNotification": "В выбранном направлении нет данных."
});