define({
  "layersPage": {
    "allLayers": "ชั้นข้อมูลทั้งหมด",
    "title": "เลือกเทมเพลตเพื่อสร้างฟีเจอร์",
    "generalSettings": "ตั้งค่าทั่วไป",
    "layerSettings": "การตั้งค่าชั้นข้อมูล",
    "smartActionsTabTitle": "สมาร์ทแอคชัน",
    "attributeActionsTabTitle": "การดำเนินการของแอ็ตทริบิวต์",
    "presetValueText": "กำหนดค่าที่กำหนดไว้ล่วงหน้า",
    "geocoderSettingsText": "การตั้งค่าตัวระบุรหัสพิกัดทางภูมิศาสตร์",
    "editDescription": "ให้แสดงข้อความสำหรับพาเนลที่แก้ไข",
    "editDescriptionTip": "ข้อความนี้จะปรากฏเหนือเทมเพลต ให้ปล่อยว่างไว้สำหรับข้อความใดๆ",
    "promptOnSave": "พร้อมที่จะบันทึกการแก้ไขไม่ได้บันทึกไว้เมื่อฟอร์มถูกปิดหรือเปลี่ยนไประเบียนถัดไป",
    "promptOnSaveTip": "แสดงการแจ้งเตือนเมื่อผู้ใช้คลิกปิดหรือนำทางไปยังเรคคอร์ทที่สามารถแก้ไขได้ต่อไป เมื่อฟีเจอร์ปัจจุบันมีการแก้ไขที่ไม่ได้บันทึก",
    "promptOnDelete": "ต้องการการยืนยันเมื่อลบเรคคอร์ท",
    "promptOnDeleteTip": "แสดงข้อความแจ้งเมื่อผู้ใช้คลิกลบเพื่อยืนยันการดำเนินการ",
    "removeOnSave": "ลบฟีเจอร์จากที่เลือกไว้เมื่อบันทึก",
    "removeOnSaveTip": "ตัวเลือกในการลบฟีเจอร์จากการตั้งค่าตัวเลือกจะถูกบันทึกไว้ ถ้ามันเป็นเพียงบันทึกการเลือกเรคคอร์ท พาเนลจะเปลี่ยนกลับไปที่หน้าเทมเพลต",
    "useFilterEditor": "ใช้ตัวกรองฟีเจอร์เทมเพลต",
    "useFilterEditorTip": "ตัวเลือกในการใช้ตัวเลือกแม่แบบตัวกรองซึ่งให้ความสามารถในการดูแม่แบบของหนึ่งชั้นข้อมูลหรือค้นหาแม่แบบตามชื่อ",
    "displayShapeSelector": "แสดงตัวเลือกการวาดภาพ",
    "createNewFeaturesFromExisting": "อนุญาตให้ผู้ใช้สร้างฟีเจอร์ใหม่จากฟีเจอร์ที่มีอยู่",
    "createNewFeaturesFromExistingTip": "ตัวเลือกในการอนุญาตให้ผู้ใช้คัดลอกฟีเจอร์ที่มีอยู่เพื่อสร้างฟีเจอร์ใหม่",
    "copiedFeaturesOverrideDefaults": "ค่าฟีเจอร์ที่คัดลอกจะแทนที่ค่าเริ่มต้น",
    "copiedFeaturesOverrideDefaultsTip": "ค่าจากฟีเจอร์ที่คัดลอกจะแทนที่ค่าเทมเพลตเริ่มต้น เฉพาะสำหรับฟิลด์ที่ตรงกัน",
    "displayShapeSelectorTip": "ตัวเลือกเพื่อแสดงรายการการวาดภาพที่ถูกต้องสำหรับเทมเพลตที่เลือก",
    "displayPresetTop": "แสดงค่าที่ตั้งไว้ล่วงหน้าที่ด้านบน",
    "displayPresetTopTip": "ตัวเลือกเพื่อแสดงรายการค่าที่ตั้งล่วงหน้าไว้เหนือตัวเลือกเทมเพลต",
    "listenToGroupFilter": "ปรับใช้ค่าการกรองจากกลุ่มวิดเจ็ตตัวกรองไปยังฟิลด์ที่ตั้งไว้ล่วงหน้า",
    "listenToGroupFilterTip": "เมื่อตัวกรองถูกใช้กับหลุ่มวิดเจ็ตตัวกรอง ใช้ค่าที่สอดต้องกับฟิลด์ในลิสต์ที่เตรียมไว้ล่วงหน้า",
    "keepTemplateActive": "ทำให้เท็มเพลตที่เลือกใช้งานได้",
    "keepTemplateActiveTip": "เมื่อเท็มเพลตที่เลือกถูกแสดงขึ้น หากมีการเลือกเท็มเพลตไว้ ให้เลือกอีกครั้งหนึ่ง",
    "geometryEditDefault": "เปิดใช้งานการแก้ไขรูปทรงเรขาคณิตโดยค่าเริ่มต้น",
    "autoSaveEdits": "บันทึกฟีเจอร์ใหม่โดยอัตโนมัติ",
    "enableAttributeUpdates": "แสดงปุ่มการอัปเดตการดำเนินการของแอ็ตทริบิวต์เมื่อใช้งานการแก้ไขเรขาคณิต",
    "enableAutomaticAttributeUpdates": "เรียกใช้การดำเนินการแอตทริบิวต์โดยอัตโนมัติ ภายหลังการอัพเดตเรขาคณิต",
    "enableLockingMapNavigation": "เปิดใช้งานการล็อคการนำทางแผนที่",
    "enableMovingSelectedFeatureToGPS": "เปิดใช้งานการย้ายฟีเจอร์จุดที่เลือกไปยังที่ตั้ง GPS",
    "enableMovingSelectedFeatureToXY": "เปิดใช้งานการย้ายฟีเจอร์จุดที่เลือกไปยังที่ตั้ง XY",
    "featureTemplateLegendLabel": "เทมเพลตฟีเจอร์และการตั้งค่าตัวกรอง",
    "saveSettingsLegendLabel": "บันทึกการตั้งค่า",
    "geometrySettingsLegendLabel": "การตั้งค่าเรขาคณิต",
    "buttonPositionsLabel": "ตำแหน่งปุ่มบันทึก, ลบ, ย้อนกลับ และล้างข้อมูล",
    "belowEditLabel": "ด้านล่างฟอร์มแก้ไข",
    "aboveEditLabel": "ด้านบนฟอร์มแก้ไข",
    "layerSettingsTable": {
      "allowDelete": "อนุญาตให้ลบ",
      "allowDeleteTip": "อนุญาตการลบ - ตัวเลือกที่อนุญาตให้ผู้ใช้ลบฟีเจอร์ หรือปิดใช้งานหากชั้นข้อมูลไม่รองรับการลบ",
      "edit": "ที่สามารถแก้ไขได้",
      "editTip": "แก้ไขได้ - ตัวเลือกในการเพิ่มชั้นข้อมูลลงในวิดเจ็ต",
      "label": "ชั้นข้อมูล",
      "labelTip": "ชั้นข้อมูล - ชื่อของชั้นข้อมูลตามที่กำหนดไว้ในแผนที่",
      "update": "ไม่สามารถใช้งานการแก้ไขด้านเรขาคณิตได้",
      "updateTip": "ปิดใช้งานการแก้ไขรูปทรงเรขาคณิต - ตัวเลือกในการปิดใช้งานความสามารถในการย้ายรูปทรงเรขาคณิตหลังจากวางไปแล้ว หรือย้ายรูปทรงเรขาคณิตบนฟีเจอร์ที่มีอยู่",
      "allowUpdateOnly": "เฉพาะการอัพเดทเท่านั้น",
      "allowUpdateOnlyTip": "อัปเดตเท่านั้น - ตัวเลือกในการอนุญาตเฉพาะการแก้ไขฟีเจอร์ที่มีอยู่ จะเลือกไว้ตามค่าเริ่มต้น และจะปิดใช้งานหากชั้นข้อมูลไม่รองรับการสร้างฟีเจอร์ใหม่",
      "fieldsTip": "การปรับฟิลด์ให้แก้ไข และกำหนดสมาร์ทแอตทริบิวต์",
      "actionsTip": "การดำเนินการ - ตัวเลือกในการแก้ไขฟิลด์หรือเข้าใช้งานชั้นข้อมูล/ตารางที่เกี่ยวข้อง",
      "description": "คำอธิบาย",
      "descriptionTip": "คำอธิบาย - ตัวเลือกในการป้อนข้อความที่จะแสดงผลด้านบนของหน้าแอตทริบิวต์",
      "relationTip": "ดูชั้นข้อมูลและตารางที่เกี่ยวข้อง"
    },
    "editFieldError": "การปรับเปลี่ยนฟิลด์และสมาร์ทแอตทริบิวต์ไม่สามารถใช้ได้กับเลชั้นข้อมูลที่ไม่สามารถแก้ไขได้",
    "noConfigedLayersError": "สมาร์ทเอดิเตอร์ต้องใช้งานกับชั้นข้อมูลที่สามารถแก้ไขได้",
    "toleranceErrorMsg": "ค่าระยะการตัดเริ่มต้น"
  },
  "editDescriptionPage": {
    "title": "กำหนดข้อความบรรยายภาพรวมของแอตทริบิวต์ <b>${layername}</b> "
  },
  "fieldsPage": {
    "title": "กำหนดค่าฟิลด์สำหรับ<b>${layername}</b>",
    "copyActionTip": "การดำเนินการของแอ็ตทริบิวต์",
    "editActionTip": "สมาร์ทแอคชัน",
    "description": "ใช้ปุ่มแก้ไขการดำเนินการเพื่อเปิดใช้งานแอตทริบิวต์อัจฉริยะในชั้นข้อมูล แอตทริบิวต์อัจฉริยะสามารถกำหนด ซ่อนหรือปิดใช้งานฟิลด์ตามค่าในฟิลด์อื่น ๆ ได้ ใช้ปุ่มคัดลอกการดำเนินการเพื่อเปิดใช้งานและกำหนดแหล่งที่มาของค่าในฟิลด์ตามจุดตัดกัน ที่อยู่ พิกัดและที่ตั้งค่าล่วงหน้า",
    "fieldsNotes": "* เป็นฟิลด์บังคับ หากคุณยกเลิกการเลือกแสดงผลสำหรับฟิลด์นี้ และแก้ไขแม่แบบ จะไม่มีการเติมค่าให้กับฟิลด์นี้ ที่คุณจะไม่สามารถบันทึกข้อมูลใหม่ได้",
    "smartAttachmentText": "กำหนดค่าการดำเนินการของไฟล์แนบอัจฉริยะ",
    "smartAttachmentPopupTitle": "กำหนดค่าไฟล์แนบอัจฉริยะสำหรับ <b>${layername}</b>",
    "fieldsSettingsTable": {
      "display": "แสดงผล",
      "displayTip": "การแสดงผล - กำหนดว่าฟิลด์นี้สามารถมองเห็นได้หรือไม่",
      "edit": "ที่สามารถแก้ไขได้",
      "editTip": "แก้ไขได้ - เลือกหากฟิลด์นี้แสดงในฟอร์มแอตทริบิวต์",
      "fieldName": "ชื่อ",
      "fieldNameTip": "ชื่อ - ชื่อของฟิลด์ที่กำหนดไว้ในฐานข้อมูล",
      "fieldAlias": "ชื่อย่อ",
      "fieldAliasTip": "นามแฝง - ชื่อของฟิลด์ที่กำหนดไว้ในแผนที่",
      "canPresetValue": "ตั้งล่วงหน้า",
      "canPresetValueTip": "พรีเซ็ต - ตัวเลือกในการแสดงฟิลด์ในรายการฟิลด์พรีเซ็ต และอนุญาตให้ผู้ใช้ตั้งค่าก่อนทำการแก้ไข",
      "actions": "การดำเนินการ",
      "actionsTip": "การดำเนินการ - เปลี่ยนลำดับของฟิลด์หรือตั้งค่าสมาร์ทแอตทริบิวต์"
    },
    "smartAttSupport": "สมาร์ทแอตทริบิวต์ยังไม่ได้รับการสนับสนุนในฟิลด์ของฐานข้อมูลนี้"
  },
  "actionPage": {
    "title": "กำหนดค่าการดำเนินการของแอ็ตทริบิวต์สำหรับ <b>${fieldname}</b>",
    "smartActionTitle": "กำหนดค่าการดำเนินการสมาร์ทแอตทริบิวต์สำหรับ <b>${fieldname}</b>",
    "description": "การดำเนินการนี้ จะปิดจนกว่าคุณจะระบุเงื่อนไขที่ทำให้ทำงาน การดำเนินการทำงานตามลำดับ และจะทำได้เพียงหนึ่งการกระทำต่อแต่ละฟิลด์ ใช้ปุ่มแก้ไขเกณฑ์ ในการกำหนดเกณฑ์",
    "copyAttributesNote": "การปิดใช้งานการดำเนินการใด ๆ ที่มีชื่อกลุ่ม จะเหมือนกับการแก้ไขการดำเนินการนั้นแยกต่างหาก และจะลบการดำเนินการของฟิลด์นี้จากกลุ่มดังกล่าว",
    "actionsSettingsTable": {
      "rule": "ปฏิบัติ",
      "ruleTip": "การดำเนินการ - จะดำเนินการเมื่อเป็นไปตามเกณฑ์",
      "expression": "สูตรคำนวณ",
      "expressionTip": "นิพจน์ - นิพจน์ผลลัพธ์ในรูปแบบ SQL จากเกณฑ์ที่กำหนด",
      "groupName": "ชื่อกลุ่ม",
      "groupNameTip": "ชื่อกลุ่ม - แสดงชื่อกลุ่มจากที่มีการใช้นิพจน์",
      "actions": "เกณฑ์",
      "actionsTip": "เกณฑ์ - เปลี่ยนลำดับของกฎ และกำหนดเกณฑ์เมื่อมีการทำงาน"
    },
    "copyAction": {
      "description": "แหล่งข้อมูลของฟิลด์จะได้รับการประมวลผลตามลำดับหากเปิดใช้งานจนกว่าจะมีการเรียกใช้เกณฑ์ที่ถูกต้องหรือรายการที่สมบูรณ์ ใช้ปุ่มแก้ไขเกณฑ์เพื่อกำหนดเกณฑ์",
      "intersection": "ทางแยก",
      "coordinates": "ค่าพิกัด",
      "address": "ที่อยู่",
      "preset": "ตั้งล่วงหน้า",
      "actionText": "การดำเนินการ",
      "criteriaText": "เกณฑ์",
      "enableText": "เปิดการใช้งาน"
    },
    "actions": {
      "hide": "ซ่อน",
      "required": "ต้องการ",
      "disabled": "ปิดการใช้งาน"
    },
    "editOptionsPopup": {
      "editAttributeGroupHint": "คำเตือน: การแก้ไขแยกต่างหาก จะเป็นการลบการดำเนินการแอตทริบิวต์ที่เลือกซึ่งเชื่อมโยงกับฟิลด์นี้ออกจากลุ่ม",
      "editGroupHint": "คำเตือน: การแก้ไขแยกต่างหาก จะเป็นการลบการดำเนินการสมาร์ทที่เลือกซึ่งเชื่อมโยงกับฟิลด์นี้ออกจากลุ่ม",
      "popupTitle": "เลือกตัวเลือกการแก้ไข",
      "editAttributeGroup": "การดำเนินการแอตทริบิวต์ที่เลือก จะถูกกำหนดจากกลุ่ม เลือกหนึ่งในตัวเลือกต่อไปนี้เพื่อแก้ไขการดำเนินการแอตทริบิวต์:",
      "expression": "นิพจน์ของการดำเนินการสมาร์ทที่เลือก จะถูกกำหนดจากกลุ่ม เลือกหนึ่งในตัวเลือกต่อไปนี้ เพื่อแก้ไขนิพจน์การดำเนินการสมาร์ท:",
      "editGroupButton": "แก้ไขกลุ่ม",
      "editIndependentlyButton": "แก้ไขแยกต่างหาก"
    }
  },
  "filterPage": {
    "submitHidden": "ส่งข้อมูลแอตทริบิวต์สำหรับข้อมูลนี้ แม้ในขณะที่ฟิลด์ถูกซ่อนอยู่?",
    "title": "กำหนดเงื่อนไขสำหรับ ${action} กฎ",
    "filterBuilder": "กำหนดการกระทำเมื่อค่าในฟิลด์ตรง ${any_or_all} of จากสมการดังต่อไปนี้",
    "noFilterTip": "ใช้เครื่องมือที่ด้านล่างกำหนดคำสั่งสำหรับการดำเนินการเมื่อมีการใช้งาน"
  },
  "geocoderPage": {
    "setGeocoderURL": "ตั้งรหัสเชิงพื้นที่ URL",
    "hintMsg": "หมายเหตุ: คุณกำลังเปลี่ยนบริการตัวระบุรหัสพิกัดทางภูมิศาสตร์ โปรดตรวจสอบการอัปเดตการแม็ปฟิลด์ของตัวระบุรหัสพิกัดทางภูมิศาสตร์ที่คุณกำหนดไว้",
    "invalidUrlTip": "URL ${URL} ไม่ถูกต้อง หรือไม่สามารถเข้าถึงได้"
  },
  "addressPage": {
    "popupTitle": "ที่อยู่",
    "checkboxLabel": "รับค่าจากตัวระบุรหัสพิกัดทางภูมิศาสตร์",
    "selectFieldTitle": "เชิงบรรยาย",
    "geocoderHint": "หากต้องการเปลี่ยนแปลงตัวระบุพิกัดทางภูมิศาสตร์ ให้ไปที่ปุ่ม 'การตั้งค่าตัวระบุพิกัดทางภูมิศาสตร์' ในการตั้งค่าทั่วไป",
    "prevConfigruedFieldChangedMsg": "ไม่พบแอตทริบิวต์ที่กำหนดค่าไว้ก่อนหน้านี้ ในการตั้งค่าพิกัดทางภูมิศาสตร์ปัจจุบัน แอตทริบิวต์ถูกรีเซ็ตเป็นค่าเริ่มต้น"
  },
  "coordinatesPage": {
    "popupTitle": "ค่าพิกัด",
    "checkboxLabel": "รับพิกัด",
    "coordinatesSelectTitle": "ระบบพิกัด",
    "coordinatesAttributeTitle": "เชิงบรรยาย",
    "mapSpatialReference": "การอ้างอิงเชิงพื้นที่ของแผนที่",
    "latlong": "ละติจูด/ลองจิจูด",
    "allGroupsCreatedMsg": "กลุ่มที่เป็นไปได้ทั้งหมดถูกสร้างขึ้นอยู่แล้ว"
  },
  "presetPage": {
    "popupTitle": "ตั้งล่วงหน้า",
    "checkboxLabel": "ฟิลด์จะถูกตั้งค่าล่วงหน้า",
    "presetValueLabel": "ค่าที่กำหนดไว้ล่วงหน้าปัจจุบันคือ:",
    "changePresetValueHint": "หากต้องการเปลี่ยนค่าที่กำหนดไว้ล่วงหน้า ให้ไปที่ปุ่ม 'กำหนดค่าที่กำหนดไว้ล่วงหน้า' ในการตั้งค่าทั่วไป"
  },
  "intersectionPage": {
    "groupNameLabel": "ชื่อ",
    "dataTypeLabel": "ประเภทข้อมูล",
    "ignoreLayerRankingCheckboxLabel": "ไม่สนใจอันดับชั้นข้อมูล และค้นหาฟีเจอร์ที่ใกล้ที่สุดจากชั้นข้อมูลที่กำหนดไว้ทั้งหมด",
    "intersectingLayersLabel": "ชั้นข้อมูลที่จะแยกค่า",
    "layerAndFieldsApplyLabel": "ชั้นข้อมูลและฟิลด์ที่จะใช้ค่าที่แยก",
    "checkboxLabel": "รับค่าจากฟิลด์ของชั้นข้อมูลจุดตัดกัน",
    "layerText": "ชั้นข้อมูล",
    "fieldText": "ฟิลด์",
    "actionsText": "การดำเนินการ",
    "toleranceSettingText": "การตั้งค่าระยะ",
    "addLayerLinkText": "เพิ่มชั้นข้อมูล",
    "useDefaultToleranceText": "ใช้ระยะเริ่มต้น",
    "toleranceValueText": "ค่าระยะ",
    "toleranceUnitText": "ยูนิตระยะ",
    "useLayerName": "- ใช้ชื่อชั้นข้อมูล -",
    "noLayersMessage": "ไม่พบฟิลด์ในชั้นข้อมูลใด ๆ ของแผนที่ ซึ่งตรงกับประเภทข้อมูลที่เลือก"
  },
  "presetAll": {
    "popupTitle": "กำหนดค่าที่กำหนดไว้ล่วงหน้าเริ่มต้น",
    "deleteTitle": "ลบค่าที่กำหนดไว้ล่วงหน้า",
    "hintMsg": "ชื่อช่องฟิลด์ที่กำหนดไว้ล่วงหน้าเฉพาะทั้งหมดจะปรากฏที่นี่ การลบฟิลด์ที่กำหนดไว้ล่วงหน้าออกจะปิดใช้งานฟิลด์ที่เกี่ยวข้องตามที่กำหนดไว้ล่วงหน้าจากชั้นข้อมูล/ตารางทั้งหมด"
  },
  "intersectionTolerance": {
    "intersectionTitle": "ระยะแยกเริ่มต้น"
  },
  "smartActionsPage": {
    "addNewSmartActionLinkText": "เพิ่มใหม่",
    "definedActions": "การดำเนินการที่กำหนด",
    "priorityPopupTitle": "ตั้งค่าลำดับความสำคัญของการดำเนินการสมาร์ท",
    "priorityPopupColumnTitle": "สมาร์ทแอคชัน",
    "priorityOneText": "1",
    "priorityTwoText": "2",
    "priorityThreeText": "3",
    "groupNameLabel": "ชื่อกลุ่ม",
    "layerForExpressionLabel": "ชั้นข้อมูลสำหรับนิพจน์",
    "layerForExpressionNote": "หมายเหตุ: ฟิลด์ของชั้นข้อมูลที่เลือกจะถูกใช้ในการกำหนดเกณฑ์",
    "expressionText": "สูตรคำนวณ",
    "editExpressionLabel": "แก้ไขสูตรคำนวณ",
    "layerAndFieldsApplyLabel": "ชั้นข้อมูลและฟิลด์ที่จะใช้",
    "submitAttributeText": "ส่งข้อมูลแอตทริบิวต์สำหรับฟิลด์ที่ซ่อนอยู่ที่เลือกหรือไม่",
    "priorityColumnText": "ลำดับความสำคัญ",
    "requiredGroupNameMsg": "ต้องใส่ค่านี้",
    "uniqueGroupNameMsg": "ป้อนชื่อกลุ่มที่ไม่ซ้ำกัน มีกลุ่มที่ใช้ชื่อนี้อยู่แล้ว",
    "deleteGroupPopupTitle": "ลบกลุ่มการดำเนินการสมาร์ท",
    "deleteGroupPopupMsg": "การลบกลุ่มจะเป็นการลบนิพจน์จากการดำเนินการฟิลด์ที่เชื่อมโยงทั้งหมด",
    "invalidExpression": "ต้องไม่เว้นว่างนิพจน์",
    "warningMsgOnLayerChange": "นิพจน์ที่กำหนดและฟิลด์ที่ใช้จะถูกลบออก",
    "smartActionsTable": {
      "name": "ชื่อ",
      "expression": "สูตรคำนวณ",
      "definedFor": "กำหนดไว้สำหรับ"
    }
  },
  "attributeActionsPage": {
    "name": "ชื่อ",
    "type": "ชนิด",
    "deleteGroupPopupTitle": "ลบกลุ่มการดำเนินการแอตทริบิวต์",
    "deleteGroupPopupMsg": "การลบกลุ่มจะเป็นการลบการดำเนินการแอตทริบิวต์จากฟิลด์ที่เชื่อมโยง",
    "alreadyAppliedActionMsg": "มีการใช้การดำเนินการ ${action} บนฟิลด์นี้อยู่แล้ว"
  },
  "chooseFromLayer": {
    "fieldLabel": "ฟิลด์",
    "valueLabel": "ค่า",
    "selectValueLabel": "เลือกค่า"
  },
  "presetPopup": {
    "presetValueLAbel": "ค่าที่ตั้งไว้ล่วงหน้า"
  },
  "dataType": {
    "esriFieldTypeString": "ตัวหนังสือ",
    "esriFieldTypeInteger": "จำนวน",
    "esriFieldTypeDate": "วันที่",
    "esriFieldTypeGUID": "GUID"
  }
});