define({
  "_widgetLabel": "Аналіз",
  "executeAnalysisTip": "Клацніть на інструменті аналізу для виконання",
  "noToolTip": "Інструмент аналізу не налаштовано!",
  "jobSubmitted": "надано.",
  "jobCancelled": "Скасовано.",
  "jobFailed": "Не вдалося",
  "jobSuccess": "Успішно.",
  "executing": "Виконується",
  "cancelJob": "Скасувати задачу аналізу",
  "paramName": "Назва параметру",
  "learnMore": "Дізнатись більше",
  "outputtip": "Примітка: виведення об’єктів та таблиці додаються в карту як робочі шари.",
  "outputSaveInPortal": "Дані було збережено на вашому порталі.",
  "privilegeError": "Користувач не може виконувати аналіз. Для виконання аналізу адміністратор вашої організації повинен надати вам певні <a href=\"http://doc.arcgis.com/en/arcgis-online/reference/roles.htm\" target=\"_blank\">права</a>.",
  "noServiceError": "Немає доступних сервісів просторового аналізу. Перевірте налаштування вашого порталу."
});