define({
  "_widgetLabel": "Фильтр",
  "toggleTip": "Щелкните, чтобы показать/скрыть настройки фильтра",
  "toggleOn": "Нажмите кнопку переключения, чтобы включить текущий фильтр",
  "toggleOff": "Нажмите кнопку переключения, чтобы отключить текущий фильтр",
  "filterActions": "Фильтр действий",
  "resetAll": "Сброс всех входных значений",
  "turnOffAll": "Выключить все фильтры",
  "createCustomFilter": "Создание пользовательского фильтра",
  "customFilter": "Пользовательский фильтр",
  "toggleCustomFilter": "Включите/выключите фильтр",
  "toggleCustomFilters": "Включить или выключить все фильтры"
});