define({
  "settingsHeader": "Задати детальні дані для віджету «Геопошук»",
  "settingsDesc": "Виконати геозбагачення списку місць розташування з файлу CSV проти шарів полігону на карті. Вибрані поля з шарів полігону приєднані до місць розташування.",
  "settingsLoadingLayers": "Зачекайте, поки шари завантажуються.",
  "settingsConfigureTitle": "Налаштувати поля шару",
  "layerTable": {
    "colEnrich": "Збагатити",
    "colLabel": "Шар",
    "colFieldSelector": "Поля"
  },
  "fieldTable": {
    "colAppend": "Приєднати",
    "colName": "Назва",
    "colAlias": "Псевдонім",
    "colOrder": "Дії",
    "label": "Відмітьте поля, які необхідно приєднати. Виберіть поле для оновлення його псевдоніму та порядку."
  },
  "symbolArea": {
    "symbolLabelWithin": "Виберіть символ для місць розташування в межах:",
    "symbolLabelOutside": "Виберіть символ для місць розташування поза межами:"
  },
  "advSettings": {
    "label": "Розширені налаштування",
    "latFieldsDesc": "Можливі назви для поля «Широта».",
    "longFieldsDesc": "Можливі назви для поля «Довгота».",
    "intersectFieldDesc": "Назва створеного поля для збереження значення, якщо пошук перетнув шар.",
    "intersectInDesc": "Значення для збереження, коли місце розташування перетнуло полігон.",
    "intersectOutDesc": "Значення для збереження, коли місце розташування не перетнуло полігон.",
    "maxRowCount": "Максимальна кількість рядків у файлі CSV.",
    "cacheNumberDesc": "Вказати порогове значення кластеру для прискорення обробки.",
    "subTitle": "Задати значення для файлу CSV.",
    "geometryServiceDesc": "URL сервісу геометрії для повторного проектування точок."
  },
  "noPolygonLayers": "Немає полігональних шарів",
  "errorOnOk": "Заповніть всі параметри перед збереженням конфігурації",
  "saveFields": "Зберегти поля",
  "cancelFields": "Скасувати поля",
  "saveAdv": "Зберегти розширені Налаштування",
  "cancelAdv": "Скасувати розширені Налаштування",
  "advSettingsBtn": "Розширені налаштування",
  "chooseSymbol": "Вибрати символ",
  "okBtn": "OK",
  "cancelBtn": "Скасувати"
});