define({
  "_widgetLabel": "Εργαλείο έξυπνης επεξεργασίας",
  "noEditPrivileges": "Ο λογαριασμός σας δεν έχει δικαίωμα δημιουργίας ή τροποποίησης δεδομένων.",
  "widgetActive": "Ενεργή",
  "widgetNotActive": "Μη ενεργή",
  "pressStr": "Πατήστε ",
  "ctrlStr": " CTRL ",
  "snapStr": " για να ενεργοποιηθεί η λειτουργία αγκίστρωσης",
  "noAvailableTempaltes": "Δεν υπάρχουν διαθέσιμα πρότυπα",
  "editorCache": " - Εργαλείο επεξεργασίας Cache",
  "presetFieldAlias": "Πεδίο",
  "presetValue": "Προκαθορισμένη τιμή",
  "usePresetValues": " Χρήση προκαθορισμένων τιμών (Μόνο νέα στοιχεία)",
  "editGeometry": " Επεξεργασία γεωμετρικού τύπου",
  "savePromptTitle": "Αποθήκευση στοιχείου",
  "savePrompt": "Θέλετε να αποθηκευτεί το τρέχον στοιχείο;",
  "deletePromptTitle": "Διαγραφή στοιχείου",
  "deletePrompt": "Είστε βέβαιοι ότι θέλετε να διαγράψετε το επιλεγμένο στοιχείο;",
  "attachmentLoadingError": "Σφάλμα στην αποστολή των συνημμένων",
  "attachmentSaveDeleteWarning": "Προειδοποίηση: Οι αλλαγές στα συνημμένα αποθηκεύτηκαν αυτόματα",
  "filterEditor": {
    "all": "Όλοι",
    "noAvailableTempaltes": "Δεν υπάρχουν διαθέσιμα πρότυπα",
    "searchTemplates": "Αναζήτηση προτύπων"
  },
  "invalidConfiguration": "To widget δεν είναι διαμορφωμένο ή τα θεματικά επίπεδα στη διαμόρφωση δεν βρίσκονται πλέον στο χάρτη. Ανοίξτε την εφαρμογή στη λειτουργία Εργαλείο δημιουργίας και αναδιαμορφώστε το widget."
});