define({
  "_widgetLabel": "Фільтр",
  "toggleTip": "Клацніть, щоб показати/приховати налаштування фільтра",
  "toggleOn": "Натисніть кнопку-перемикач, щоб увімкнути поточний фільтр",
  "toggleOff": "Натисніть кнопку-перемикач, щоб вимкнути поточний фільтр",
  "filterActions": "Фільтрувати дії",
  "resetAll": "Обнулити всі вхідні значення",
  "turnOffAll": "Вимкнути всі фільтри",
  "createCustomFilter": "Створити власний фільтр",
  "customFilter": "Власний фільтр",
  "toggleCustomFilter": "Увімкнути або вимкнути фільтр",
  "toggleCustomFilters": "Увімкнути або вимкнути всі фільтри"
});